In [1]:
from sklearn import preprocessing

import pandas as pd
import numpy as np

In [2]:
data = [25000000, 35000000, 30000000, 50000000, 35000000]
np_data = np.array(data)

np_data

array([25000000, 35000000, 30000000, 50000000, 35000000])

In [3]:
df = pd.DataFrame(np_data, columns = ['Salary'])

df

     Salary
0  25000000
1  35000000
2  30000000
3  50000000
4  35000000

In [4]:
scaler = preprocessing.MinMaxScaler()
scaler

MinMaxScaler()

In [5]:
normalized_data = scaler.fit_transform(df)

normalized_data

array([[0. ],
       [0.4],
       [0.2],
       [1. ],
       [0.4]])

In [6]:
final_df = pd.DataFrame(normalized_data, columns = ['Salary'])

final_df

   Salary
0     0.0
1     0.4
2     0.2
3     1.0
4     0.4

In [7]:
pd.set_option('display.float_format', lambda x : '%.2f' %x)

final_df

   Salary
0    0.00
1    0.40
2    0.20
3    1.00
4    0.40